app/views/users/_form.html.erb

SELECT "users".* FROM "users"
---
      <td>
        <%= f.select :role, ['Admin', 'User'] %>