app/views/posts/search.html.erb

             if post.id != post.post_id
                @parentPost = Post.find(:first, :conditions => "id = #{post.post_id}")
---
SELECT "posts".* FROM "posts" WHERE (lower(post) like '%fool%' )

                  </tr><tr><td width="80%">&nbsp;</td> <td class="round" align = "right" bgcolor="#7D1B7E"><font color="white">
                       <% @temp = Vote.find(:all, :conditions => "post_id = '#{reply.id}'")
---
SELECT "votes".* FROM "votes" WHERE (post_id = '7' and user_id = '')

                        <% @temp = Vote.find(:all, :conditions => "post_id = '#{reply.id}' and user_id = '#{session[:user_id]}'" ) %>
                      <% if !session[:user_id].nil? && !(reply.user_id == session[:user_id]) && !(@temp.size > 0) %>
---
SELECT "users".* FROM "users" WHERE (lower(username) like '%srikanth%' or lower(fullname) like '%srikanth%')