app/views/posts/show.html.erb


                <% @replies = Post.find(:all, :conditions => "id != #{@post.id} and post_id = #{@post.id}") %>
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]

                  </tr> <tr><td width="80%">&nbsp;</td> <td class="round" align = "right" bgcolor="#7D1B7E"><font color="white">
                       <% @temp = Vote.find(:all, :conditions => "post_id = '#{reply.id}'")
---
SELECT "votes".* FROM "votes" WHERE (post_id = '1' and user_id = '1')