app/controllers/posts_controller.rb

  def index
    #@posts = Post.all
    @posts = Post.find(:all, :order=> "post_id")
---
SELECT "posts".* FROM "posts" WHERE (id != 1 and post_id = 1)

  def create
    @post = Post.new(params[:post])
    @post.user_id=session[:user_id]


    respond_to do |format|
      if @post.save
---
INSERT INTO "posts" ("created_at", "post", "post_id", "updated_at", "user_id", "weight") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 06 Oct 2011 03:07:50 UTC +00:00], ["post", "1"], ["post_id", 0], ["updated_at", Thu, 06 Oct 2011 03:07:50 UTC +00:00], ["user_id", 1], ["weight", 1]]

  def update
    @post = Post.find(params[:id])

    respond_to do |format|
      if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "6"]]
UPDATE "posts" SET "post" = 'Hi, I''m Srikanth and I''m a fool. I''m so glad I am ', "updated_at" = '2011-10-07 06:28:16.386680' WHERE "posts"."id" = 6

  def createreply
    @post = Post.find(params[:id])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]

  def reply
    @post = Post.new
    @post.post_id = params[:parent_post_id]
    @post.post =  params[:post]
    @post.user_id = session[:user_id]

    respond_to do |format|
    if @post.save()
---
INSERT INTO "posts" ("created_at", "post", "post_id", "updated_at", "user_id", "weight") VALUES (?, ?, ?, ?, ?, ?)  [["created_at", Thu, 06 Oct 2011 03:07:58 UTC +00:00], ["post", "2"], ["post_id", 1], ["updated_at", Thu, 06 Oct 2011 03:07:58 UTC +00:00], ["user_id", 1], ["weight", 1]]

  def upVote
    @post = Post.find(params[:id])
    @child_post = Post.find(:all, :conditions => "post_id = '#{params[:id]}'")

    if @post.id != @post.post_id
      @parent_post = Post.find(:first, :conditions => "id = '#{@post.post_id}'")
    end

    @vote = Vote.new
    @vote.post_id = params[:id]
    @vote.user_id = session[:user_id]
    @vote.save()

    @post.weight += 1

    @post.save()
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
INSERT INTO "votes" ("created_at", "post_id", "updated_at", "user_id") VALUES (?, ?, ?, ?)  [["created_at", Thu, 06 Oct 2011 03:13:11 UTC +00:00], ["post_id", 1], ["updated_at", Thu, 06 Oct 2011 03:13:11 UTC +00:00], ["user_id", 3]]
UPDATE "posts" SET "weight" = 2, "updated_at" = '2011-10-06 03:13:11.421717' WHERE "posts"."id" = 1

  def search
    @searchFor = params[:search]
    @searchType = params[:searchType]

    @searchFor = @searchFor.downcase

    @searchResult = ""
    if @searchType.to_s == "2"
      @keywords = "%".concat(@searchFor)
      @keywords = @keywords.split(" ").join("%")
      @searchResult = Post.find(:all, :conditions => "lower(post) like '#{@keywords}%' ")
    else
      @users = User.find(:all, :conditions => "lower(username) like '%#{@searchFor}%' or lower(fullname) like '%#{@searchFor}%'")
---
SELECT "posts".* FROM "posts" WHERE (lower(post) like '%fool%' )
SELECT "users".* FROM "users" WHERE (lower(username) like '%srikanth%' or lower(fullname) like '%srikanth%')