app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
  def index
    if(!session[:user_id].nil?)
      redirect_to "/posts"
    else
    @users = User.all

INSERT INTO "users" ("created_at", "fullname", "password", "role", "updated_at", "username") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
     @user = User.new(params[:user])

     if User.find(:all).empty?
       @user.role="Admin"
     end

    respond_to do |format|
      if @user.save

SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "1"]]
UPDATE "users" SET "password" = 'test1234', "updated_at" = '2011-10-04 04:14:47.510526' WHERE "users"."id" = 1
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT "users".* FROM "users" WHERE (username = NULL and password = NULL) LIMIT 1
---
  def authenticate

     @user = User.new(params[:userform])
     #find records with username,password
     valid_user = User.find(:first,:conditions => ["username = ? and password = ?",@user.username, @user.password])

SELECT "users".* FROM "users"
---
  def showallusers
    @users = User.all