app/controllers/votes_controller.rb

SELECT "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def show
    @vote = Vote.find(params[:id])

SELECT "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def edit
    @vote = Vote.find(params[:id])

SELECT "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", "980190962"]]
---
  def update
    @vote = Vote.find(params[:id])

SELECT "votes".* FROM "votes" WHERE "votes"."id" = ? LIMIT 1  [["id", "980190962"]]
DELETE FROM "votes" WHERE "votes"."id" = ?  [["id", 980190962]]
---
  def destroy
    @vote = Vote.find(params[:id])
    @vote.destroy